resume.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>./greg.out - Resume</title>
<meta name="author" content="Greg Silverstein" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="/me/css/style.css">
<link rel="alternate" type="application/rss+xml" title="./greg.out" href="/me/index.xml">
<meta name="viewport" content="width=device-width, initial-scale=1">
</head>
<body>
<div id="preamble" class="status">
<header class="site-header"><div class="wrap"><div class="brand"><a class="logo" href="/me/">./greg.out</a><div class="subtitle">Greg Silverstein's Home on the internet</div></div><nav><a href="/me/">Home</a><a href="/me/about.html">About</a><a href="/me/resume.html">Resume</a><a href="/me/index.xml">RSS</a><a href="https://github.com/gsilvers">GitHub</a></nav></div></header><div class="wrap page-head"><h1 class="page-title">Resume</h1><div class="page-meta">2023-03-25</div></div>
</div>
<div id="content" class="content">
<section id="outline-container-my-resume-on-the-web" class="outline-2">
<h2 id="my-resume-on-the-web">My Resume on the Web</h2>
<div class="outline-text-2" id="text-my-resume-on-the-web">
<p>
While I am not actively searching for employment at the moment I'm always interested to hear about interesting projects. Please see my resume and of course please feel free to email me with any questions.
</p>
</div>
<div id="outline-container-contact-information" class="outline-3">
<h3 id="contact-information">Contact Information:</h3>
<div class="outline-text-3" id="text-contact-information">
<p>
Gregory Silverstein
</p>

<p>
Bethlehem PA 18018
</p>

<p>
greg.silverstein@gmail.com
</p>
</div>
</div>
<div id="outline-container-objectives" class="outline-3">
<h3 id="objectives">Objectives:</h3>
<div class="outline-text-3" id="text-objectives">
<p>
I look to work on <i>interesting</i> software projects. Who doesn't! Specifically I enjoy projects that need help clarifying requirments and design as well as opportunities to teach less technical team memebers how to get what they really want out of a computer. I tend to enjoy working with encryption and privacy designs, generally more towards the back end of a system.
</p>
</div>
</div>
<div id="outline-container-education" class="outline-3">
<h3 id="education">Education:</h3>
<div class="outline-text-3" id="text-education">
<p>
Bachelor of Science, Computer Science
</p>

<p>
Stevens Institute of Technology, Hoboken NJ, 2001-2005
</p>
</div>
</div>
<div id="outline-container-employment-history" class="outline-3">
<h3 id="employment-history">Employment History</h3>
<div class="outline-text-3" id="text-employment-history">
</div>
<div id="outline-container-september-2022-present-senior-software-engineer" class="outline-4">
<h4 id="september-2022-present-senior-software-engineer">September 2022 &#x2013; Present Senior Software Engineer</h4>
<div class="outline-text-4" id="text-september-2022-present-senior-software-engineer">
<p>
HealthVerity, Philadelphia PA
Senior Engineer working on HealthVerity's privacy protection applications. Building HIPAA compliant applications to enable customers to gain insights from highly sensitive data. Tools used include AWS Server-less Components, AWS CDK, Python, JavaScript, R, Redis, Databricks.
</p>
</div>
</div>
<div id="outline-container-december-2019-september-2022-developer-data-engineering" class="outline-4">
<h4 id="december-2019-september-2022-developer-data-engineering">December 2019 &#x2013; September 2022 Developer Data Engineering</h4>
<div class="outline-text-4" id="text-december-2019-september-2022-developer-data-engineering">
<p>
Creditsafe USA, Allentown PA
Senior Data Engineer / Developer on a full stack team working multiple projects ranging from Creditsafe's US Web product to internal data analysis and cleansing. Performed agile ceremonies as scrum master and mentored junior developers and data analysts. Tools used include Oracle, Redshift, Python, SQL, PLSQL, Hive, Airflow.
</p>
</div>
</div>
<div id="outline-container-jan-2006-december-2019-lead-programmer-data-manager" class="outline-4">
<h4 id="jan-2006-december-2019-lead-programmer-data-manager">Jan 2006 &#x2013; December 2019 Lead Programmer / Data Manager</h4>
<div class="outline-text-4" id="text-jan-2006-december-2019-lead-programmer-data-manager">
<p>
Alight Solutions, Bridgewater NJ
Supervise, manage, cultivate and co-create SAS applications a medium sized team of developers. My team develops and creates SAS code ranging from end user data analysis to back end data scrubbing. data ranging from health insurance to 401k to retirement annuities. Additional tools used range from IBM System Z, JCL, Python and XML.
</p>
</div>
</div>
<div id="outline-container-april-2004---jan-2006-industrial-engineer" class="outline-4">
<h4 id="april-2004---jan-2006-industrial-engineer">April 2004 - Jan 2006 Industrial Engineer</h4>
<div class="outline-text-4" id="text-april-2004---jan-2006-industrial-engineer">
<p>
United Parcel Services, Parsippany and Saddlbrook NJ
Created VBA based SQL reports.
</p>
</div>
</div>
<div id="outline-container-skills" class="outline-4">
<h4 id="skills">Skills</h4>
<div class="outline-text-4" id="text-skills">
<p>
I'm a computer nerd but I will try to give a brief overview of what I am learning right now and also what I have a good deal of professional experience in.
</p>
</div>
</div>
<div id="outline-container-currently-learning" class="outline-4">
<h4 id="currently-learning">Currently Learning</h4>
<div class="outline-text-4" id="text-currently-learning">
<p>
Clojure, Common Lisp, Tic-80, Hugo Static Site Generator
</p>
</div>
</div>
<div id="outline-container-professional-experience" class="outline-4">
<h4 id="professional-experience">Professional Experience</h4>
<div class="outline-text-4" id="text-professional-experience">
<p>
Python, R, Javascript, Java, SQL, PLSQL, AWS, Azure Cloud, Git, Github, Gitops, Bash, Linux, Airflow, Hive, Redshift, Oracle, Databricks, IBM Z-OS, JCL, SAS, RDBMS, Project Management, Agile, Debugging and Testing
</p>
</div>
</div>
</div>
</section>
</div>
<div id="postamble" class="status">
<footer class="site-footer"><div class="wrap">Written by Greg Silverstein &middot; theme <a href="https://github.com/protesilaos/ef-themes">ef-cherie</a> &middot; built with org-publish in GNU Emacs</div></footer>
</div>
</body>
</html>
